Revit 2024 API
AnalyticalBusData Members
The AnalyticalBusData type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from AnalyticalDistributionNodePropertyData.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CurrentRating
 The current rating value of the analytical bus.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AnalyticalDistributionNodePropertyData.)
NumberOfPhases
 The number of phases.
 (Inherited from AnalyticalDistributionNodePropertyData.)
TotalConnectedCurrent
 The total connected current of the analytical bus.
Voltage
 The voltage value of the analytical bus.
See Also
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace